#include <stdio.h>

int	main(void)
{
	int n; //15
	int x; //3
	int y; //5

	scanf("%d%d%d",&n,&x,&y);
	// printf("%d %d %d\n",n,x,y);

	int i;
	int box = 0;
	for (i = 1; i <= n; i++){	//1から15になるまでループする。
		if(i % x == 0 || i % y == 0){
			box++;
		}
	}
		printf("%d\n",box);

		return (0);
	}

	// 【ループの中の条件分岐の中身を書いてみる】
	// i = 1 〜 15;
	// x = 3;
	// y = 5;
	// box = 1;

	// if((1 % 3 == 0) || (1 % 5 == 0)) x x
	// if((2 % 3 == 0) || (2 % 5 == 0)) x x
	// if((3 % 3 == 0) || (3 % 5 == 0)) o x
	// if((4 % 3 == 0) || (4 % 5 == 0)) x x
	// if((5 % 3 == 0) || (5 % 5 == 0)) x o
	// if((6 % 3 == 0) || (6 % 5 == 0)) o x
	// if((7 % 3 == 0) || (7 % 5 == 0)) x x
	// if((8 % 3 == 0) || (8 % 5 == 0)) x x
	// if((9 % 3 == 0) || (9 % 5 == 0)) o x
	// if((10 % 3 == 0) || (10 % 5 == 0)) x o
	// if((11 % 3 == 0) || (11 % 5 == 0)) x x
	// if((12 % 3 == 0) || (12 % 5 == 0)) o x
	// if((13 % 3 == 0) || (13 % 5 == 0)) x x
	// if((14 % 3 == 0) || (14 % 5 == 0)) x x
	// if((15 % 3 == 0) || (15 % 5 == 0)) o o
	// &&ではなく||で指定すると同じ倍数の数になった時、(15 % 3 == 0) か (15 % 5 == 0)のどちらかが判定されるから
	// 同じ数で割れた時はカウントされない。


	// #include <stdio.h>

	// int	main(void)
	// {
	// 	int n; //15
	// 	int x; //3
	// 	int y; //5

	// 	scanf("%d%d%d",&n,&x,&y);
	// 	// printf("%d %d %d\n",n,x,y);

	// 	int i;
	// 	int box = 0;
	// 	int box2 = 0;
	// 	int box3 = 0;
	// 	for (i = 1; i <= n; i++) 	//1から15になるまでループする。
	// 	{
	// 		if((((n % x) == 0) && ((n % y) == 0) && ((n % x) == (n % y))) ||	//15/3の余りが0の場合　15/3 = 5の5をboxに代入。
	// 			(((n % x) == 1) && ((n % y) == 1) && ((n % x) == (n % y))) ){	//n/xにしてた。
	// 			box  = n / x;													//3と5の倍数である15がカウントされるから1多くなる問題
	// 			box2 = n / y;													//3と5の倍数で同じ数字のものがあればカウントしない。が出せない。
	// 			box3 = ((n % x) == (n % y));
	// 			// printf("%d\n",box); X
	// 		}
	// 		// printf("%d\n",box); X
	// 	}
	// 	printf("%d\n",box);
	// 	printf("%d\n",box2);
	// 	printf("%d\n",box3);
	// 	printf("%d\n",box + box2 - box3);

	// 	return (0);
	// }
